---
kind: property
id: P:Autodesk.Revit.Exceptions.FunctionId.Function
source: html/5c588f69-25c7-b65f-ac2f-25c870437ca4.htm
---
# Autodesk.Revit.Exceptions.FunctionId.Function Property

The name of the function throwing an exception.

## Syntax (C#)
```csharp
public string Function { get; }
```